Repository: najatmerabet/Mukhliss
Catalog: lib/l10n/app_*.arb
Languages: ar

# onboarding_skip
source: Skip
ar: تخطي

# onboarding_next
source: Next
ar: التالي

# onboarding_start
source: Get Started
ar: ابدأ

# onboarding_page1_title
source: Welcome to Mukhliss!
ar: مرحبا بك في مخلص!

# onboarding_page1_description
source: Your smart and connected loyalty card. Simplify your purchases and enjoy exclusive rewards.
ar: بطاقة الولاء الذكية والمتصلة. بسّط مشترياتك واستمتع بمكافآت حصرية.

# onboarding_page2_title
source: Earn points with every purchase
ar: اكسب نقاطا مع كل عملية شراء

# onboarding_page2_description
source: Scan your QR code at our partners and collect points according to their exclusive offers.
ar: امسح رمز الاستجابة السريعة الخاص بك لدى شركائنا واجمع النقاط وفقا لعروضهم الحصرية.

# onboarding_page3_title
source: Redeem your points for gifts
ar: استبدل نقاطك بهدايا

# onboarding_page3_description
source: Transform your points into exclusive rewards at your favorite stores.
ar: حوّل نقاطك إلى مكافآت حصرية في متاجرك المفضلة.

# onboarding_page4_title
source: The more loyal you are, the more you earn!
ar: كلما كنت أكثر ولاءً، كلما ربحت أكثر!

# onboarding_page4_description
source: Discover exclusive offers nearby and maximize your benefits.
ar: اكتشف العروض الحصرية القريبة منك وعظّم فوائدك.

# currentLanguage
source: English
ar: اللغة العربية

# errorAuthSamePassword
source: The new password must be different from the old one
ar: يجب أن تكون كلمة المرور الجديدة مختلفة عن القديمة

# successSignup
source: Signup successful!
ar: تم التسجيل بنجاح!

source: Select language
ar: اختر اللغة

# languageSubtitle
source: Select your preferred language
ar: اختر لغتك المفضلة

source: Cancel
ar: إلغاء

# languageChanged
source: Language changed to English
ar: تم تغيير اللغة إلى العربية

# languageAlreadySet
source: Language already set to English
ar: اللغة مضبوطة بالفعل على العربية

# language
source: Langue
ar: اللغة

# french
source: Français
ar: الفرنسية

# english
source: Anglais
ar: الإنجليزية

# arabic
source: Arabe
ar: العربية

# hello
source: Welcome to MUKHLISS
ar: مرحبًا بك في MUKHLISS

# identificationTitleqrcode
source: My Identification
ar: هويتي

# qrCodeInstructions
source: Show this QR code to benefit from your offer
ar: أظهر هذا الرمز للاستفادة من العرض

source: Phone
ar: رقم الهاتف

source: e-mail
ar: بريد إلكتروني

source: Address
ar: العنوان

# membredepuis
source: Member since
ar: عضو منذ

# identificationTitleprofile
source: My Profile
ar: ملفي الشخصي

# informationperso
source: Personal Information
ar: المعلومات الشخصية

# connectezvous
source: Log in to continue
ar: يرجى تسجيل الدخول للمتابعة

source: Welcome
ar: مرحبًا

source: Password
ar: كلمة المرور

# forgetpassword
source: Forgotten password ?
ar: هل نسيت كلمة المرور؟

# connecter
source: Log in
ar: تسجيل الدخول

# ou
source: or
ar: أو

# connecteravecgoogle
source: Sign in with Google
ar: تسجيل الدخول باستخدامGoogle

# pasdecompte
source: No account yet?
ar: ليس لديك حساب بعد؟

# regoinez
source: Join our community
ar: انضم إلى عائلتنا

# prenom
source: First name
ar: الاسم الأول

# nom
source: Last name
ar: اسم العائلة

# adresseemail
source: E-mail address
ar: عنوان البريد الإلكتروني

# numphone
source: Phone number
ar: رقم الهاتف

# adressecomplet
source: Full address
ar: العنوان الكامل

# confirmepassword
source: Confirm password
ar: تأكيد كلمة المرور

# creecompte
source: Create my account
ar: إنشاء حسابي

# vousavezcompte
source: Already have an account?
ar: هل لديك حساب بالفعل؟

# requis
source: Required
ar: مطلوب

# emailinvalid
source: Invalid email
ar: بريد إلكتروني غير صحيحح

# invalidphone
source: Invalid number
ar: رقم غير صحيحح

# entrezemail
source: Please enter your email
ar: يرجى إدخال البريد الإلكتروني

# emailinvalide
source: Please enter a valid email address
ar: يرجى إدخال بريد إلكتروني صحيحح

# lesmotspassnecorresponspas
source: Passwords do not match
ar: كلمتا المرور غير متطابقتين، يرجى التأكد

# entrzpassword
source: Please enter your password
ar: يرجى إدخال كلمة المرور

# entrzemail
source: Password must contain at least 6 characters
ar: يجب أن تحتوي كلمة المرور على 6 أحرف على الأقل

# parametre
source: Settings
ar: الإعدادات

source: COMPTE
ar: حساب

# offre
source: My Offers
ar: عروضي

# localisation
source: Location
ar: الموقع الجغرافي

# categories
source: My Categories
ar: فئات

# tous
source: All
ar: كلّ

# tousmagasins
source: Nearest stores
ar: أقرب المتاجر

# categoie
source: Category
ar: فئة

source: Distance:
ar: مسافة

# fermer
source: Close
ar: إغلاق

# iterinaire
source: Itinerary
ar: مسار

# glissez
source: Swipe to see more
ar: اسحب لرؤية المزيد

# voiture
source: Car
ar: سيارة

# marche
source: Walk
ar: المشي

# velo
source: Bike
ar: دراجة هوائية

# vers
source: Directions to
ar: مسار نحو

# duree
source: Duration
ar: مدة

source: mode
ar: نمط

# recenter
source: Refocus
ar: إعادة التمركز

# chercher
source: Find a store...
ar: ...ابحث عن متجر

# calcule
source: Calculation...
ar: ...حساب

# connectionRequired
source: You must be logged in to see your points.
ar: يجب أن تكون مسجلاً للدخول لرؤية نقاطك

# offredisponible
source: Offers available
ar: العروض المتاحة

# navigation
source: START NAVIGATION
ar: تشغيل التوجيه

# detailsiterinaire
source: ROUTE DETAILS
ar: تفاصيل المسار

# offremagasin
source: OFFER
ar: عرض

# depensez
source: Spend
ar: أنفق

# pointsagagner
source: points to win
ar: نقاط للفوز

# nooffre
source: No offers available
ar: لا توجد عروض متاحة

# arrivee
source: You have arrived at
ar: لقد وصلت الى

# disponible
source: Available
ar: متاح

# limite
source: Limit
ar: محدود

# nouvelleoffre
source: New Offers
ar: عروض جديدة

# offrerecus
source: Offers Received
ar: العروض المستلمة

# offreutilise
source: Used Offers
ar: العروض المُستخدمة

# neww
source: NEW
ar: عرض جديد

# chez
source: in
ar: عند

# partirede
source: from
ar: ابتداءً من

# detailsoffre
source: Offer details
ar: تفاصيل العرض

# profitez
source: Take advantage of this opportunity
ar: اغتنم هذه الفرصة

# description
source: Take advantage of this exclusive offer available now!
ar: لا تفوّت هذا العرض الحصري المتاح الآن

source: active
ar: مفعّل

# aujour
source: Today
ar: اليوم

# hier
source: yesterday
ar: أمس

# utilise
source: USED
ar: مُستخدم

# beneicier
source: vous avez bénéficié de
ar: لقد استفدتم من

# consomeoffre
source: This offer has already been consumed
ar: تم استخدام هذا العرض بالفعل

# consomme
source: Consumed
ar: مُستهلك

source: New Ticket
ar: إنشاء تذكرة جديدة

# besoinaide
source: Need help?
ar: هل تحتاج إلى مساعدة؟

# probleme
source: Describe your problem and we will help you quickly
ar: صف مشكلتك وسنساعدك بسرعة

# priorite
source: Priority
ar: أولوية

# sujet
source: Subject
ar: الموضوع

# resume
source: Summary of your problem
ar: يرجى تقديم ملخص لمشكلتك

# champsrequi
source: Required field
ar: حقل مطلوب

# descriptiondetaille
source: Description détaillée
ar: وصف تفصيلي

# poblemedetaille
source: Describe your problem in detail...
ar: يرجى وصف المشكلة بشكل مفصل...

# envoiencours
source: Sending...
ar: ...جارٍ الإرسال

# envoyerticket
source: Submit ticket
ar: إرسال التذكرة

# faible
source: Weak
ar: ضعيف

# normale
source: Normal
ar: طبيعي

source: Urgent
ar: عاجل

# generale
source: General
ar: عام

# technique
source: Technical
ar: فني

# autre
source: Other
ar: فئة أخرى

# ticketenvoye
source: Ticket envoyé !
ar: تم إرسال التذكرة!

# ticketsucces
source: Your ticket has been successfully created. You will receive a response within 24 hours.
ar: تم إنشاء تذكرتك بنجاح. ستتلقى ردًا خلال 24 ساعة.

# continuer
source: Continue
ar: متابعة

# eleve
source: high
ar: مرتفع

# apropos
source: About Us
ar: بخصوص

# version
source: Version 1.0.0
ar: الإصدار 1.0.0

# content
source: Mukhliss – Your smart and connected loyalty card Mukhliss is the next-generation loyalty mobile app, designed to reward your purchases and help you take advantage of the best offers around you. With Mukhliss, every purchase made in a partner store earns you points, based on the offers proposed by the merchant. Accumulate your points and exchange them for exclusive gifts in your favorite stores. The more loyal you are, the more you are rewarded!
ar: مُخلِص – بطاقتك الذكية والمتصلة للولاء مُخلِص هو تطبيق الهاتف المحمول للولاء من الجيل الجديد، صُمّم لمكافأة مشترياتك ومنحك أفضل العروض من حولك. مع مُخلِص، كل عملية شراء تقوم بها في أحد المتاجر الشريكة تمنحك نقاطًا، حسب العروض التي يقدمها التاجر. اجمع النقاط واستبدلها بهدايا حصرية في متاجرك المفضلة. كلما زاد ولاؤك، زادت مكافآتك!

# support
source: Contact & Support
ar: خدمة العملاء والدعم

# contacter
source: Contact us
ar: اتصل بنا

source: Technologies
ar: التقنيات

# desc
source: Description
ar: الوصف

# info
source: Informations
ar: المعلومات الشخصية

# voir
source: View and edit
ar: عرض وتعديل البيانات

# gerer
source: Manage
ar: إدارة

# aide
source: Help and Support
ar: الدعم الفني والمساعدة

# deconection
source: Log out
ar: تسجيل الخروج

# mesinformation
source: My Information
ar: معلوماتي الشخصية

# modifiermesinformation
source: Edit my informations
ar: تعديل معلوماتي

# sauvgarder
source: save
ar: حفظ التغييرات

source: APPLICATION
ar: التطبيقات

# theme
source: Dark theme
ar: الوضع الليلي

# netoyercacha
source: Clear cache
ar: مسح ذاكرة التخزين المؤقت

# desactive
source: Disabled
ar: معطل

# securite
source: SECURITY & PRIVACY
ar: الأمان والخصوصية

# gestionappariels
source: Device management
ar: إدارة الأجهزة

# politiques
source: Privacy Policy
ar: سياسة الخصوصية

# cachenettoye
source: Cache nettoyé avec succès
ar: تم مسح ذاكرة التخزين المؤقت بنجاح

# apparielsconnecte
source: Connected devices
ar: الأجهزة المتصلة

# statistiques
source: Statistics
ar: الإحصائيات

# inactifs
source: Inactive
ar: غير فعال

source: Total
ar: الإجمالي

# mesappariels
source: My Devices
ar: أجهزتي

# politiqueconfidentialite
source: Privacy Policy
ar: سياسة الخصوصية

# datemiseajour
source: Last updated: 08/07/2025
ar: آخر تحديث:

# premierstep
source: 1. Data collection
ar: 1. جمع البيانات

# contentstepone
source: Mukhliss collecte les données suivantes pour fournir le service de carte de fidélité : - Informations personnelles (nom, prénom, email, téléphone) - Données de localisation (pour trouver les magasins partenaires) - Historique des achats et points accumulés - Données de paiement (pour les offres premium).
ar: يقوم تطبيق مُخلِص بجمع البيانات التالية لتقديم خدمة بطاقة الولاء: - المعلومات الشخصية (الاسم، اللقب، البريد الإلكتروني، رقم الهاتف) - بيانات الموقع الجغرافي (للعثور على المتاجر الشريكة) - سجل المشتريات والنقاط المجمعة

# deusiemestep
source: 2. Use of data
ar: 2. استخدام البيانات

# contentsteptwo
source: Your data is used to: - Manage your account and loyalty card -Inform you of personalized offersn -Analyze purchasing trends - Improve our service - Prevent fraud
ar: يتم استخدام بياناتك من أجل: -إدارة حسابك وبطاقة الولاء - إبلاغك بالعروض المخصصة لك - تحليل اتجاهات الشراء - تحسين خدمتنا - منع الاحتيال

# troisemestep
source: 3. Sharing data
ar: 3. مشاركة البيانات

# contentstepthre
source: Your data may be shared with: - Partner stores where you use your card - Payment providers -Nous ne vendons jamais vos données personnelles.
ar: قد يتم مشاركة بياناتك مع: -المتاجر الشريكة التي تستخدم فيها بطاقتك -مزودي خدمات الدفع -نحن لا نبيع بياناتك الشخصية أبدًا.

# quatriemestep
source: 4. Data security
ar: 4. أمن البيانات

# contentstepfor
source: We protect your data with: : -AES-256 encryption -Two-factor authentication - Regular security audits - GDPR-compliant secure storage
ar: نحن نحمي بياناتك من خلال: - المصادقة الثنائية (2FA) - عمليات تدقيق أمني منتظمة - تخزين آمن ومتوافق مع اللائحة العامة لحماية البيانات (GDPR)

# cinquemestep
source: 5. Your rights
ar: 5. حقوقك

# contentstepfive
source: You have the right to: - Access your data - Request its correction - Delete your account - Export your data - Object to its processing -Contact us at mukhlissfidelite@gmail.com for any requests.
ar: لديك الحق في: - الوصول إلى بياناتك - طلب تصحيحها - حذف حسابك - تصدير بياناتك - الاعتراض على معالجتها -يرجى التواصل معنا عبر البريد الإلكتروني : mukhlissfidelite@gmail.com لأي طلب متعلق ببياناتك.

# compris
source: Understood
ar: مفهوم

# deconnextion
source: Disconnect
ar: تسجيل الخروج

# etresur
source: Are you sure you want to log out?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟

# exclusifs
source: EXCLUSIVE
ar: حصري

# pointsrequis
source: REQUIRED POINTS
ar: النقاط المطلوبة

# benificier
source: To benefit
ar: للاستفادة

# points
source: pts
ar: نقــاط

# ofline
source: Offline mode
ar: وضع عدم الاتصال

# noloadqrcode
source: Could not load QR code
ar: تعذر تحميل رمز الاستجابة السريعة

source: Retry
ar: إعادة المحاولة

# pasconnexioninternet
source: No Internet connection
ar: لا يوجد اتصال بالإنترنت

# veuillezvzrifier
source: Please check your connection and try again.
ar: يرجى التحقق من الاتصال وإعادة المحاولة

# aucunoffre
source: No offer used
ar: لم يتم استخدام أي عرض

# aucunoffreutilise
source: No rewards recently available
ar: لا توجد مكافآت متاحة في الوقت الحالي

# langagechangedsuccessfully
source: Language changed successfully
ar: تم تغيير اللغة بنجاح

# uneconnexionnecessaire
source: Login is required to load map and stores
ar: يلزم وجود اتصال لتحميل الخريطة والمتاجر

# connexionrequise
source: Connection required
ar: مطلوب اتصال بالإنترنت

# connecterinternet
source: To access device management, you must be connected to the internet.
ar: للوصول إلى إدارة الأجهزة، يجب أن تكون متصلاً بالإنترنت.

# verifier
source: CHECK
ar: يرجى التحقق:

# wifi
source: • Your Wi-Fi connection •Your mobile data • Your network signalt
ar: • اتصال Wi-Fi الخاص بك •بيانات الهاتف المحمول الخاصة بك • إشارة الشبكة الخاصة بك

# vereficationconnexion
source: Checking the connection...
ar: جارٍ التحقق من الاتصال…

# verificationinternet
source: Please check your internet connection
ar: يرجى التحقق من اتصالك بالإنترنت

# horsligne
source: Hors ligne - Connexion requise
ar: أنت غير متصل - يلزم الاتصال بالإنترنت

# somethingwrong
source: Something went wrong
ar: حدث خطأ ما

# signupSuccess
source: Your account has been successfully created Welcome!
ar: تم إنشاء حسابك بنجاح أهلاً وسهلاً بك!

source: Verification
ar: التحقق

# renitialisation
source: Reset
ar: إعادة تعيين كلمة المرور

# codeverifecation
source: Code de vérification
ar: رمز التحقق

# envoyerunode
source: We sent a code to
ar: لقد أرسلنا رمزًا إلى

# renvoyercode
source: Resend code
ar: إعادة إرسال الرمز

# codeexpire
source: Expired code
ar: انتهت صلاحية الرمز

# codeexpiredans
source: Code expires in
ar: ينتهي الرمز خلال

# entrercode
source: Enter the code
ar: أدخل الرمز

# nouveaucodeenvoye
source: New code sent
ar: تم إرسال رمز جديد

# ilYa
source: ago
ar: منذ

source: days
ar: أيام
